config.org
#+TITLE: Doom Emacs Configuration
#+AUTHOR: torkable
#+PROPERTY: header-args:emacs-lisp :tangle yes :cache yes :results silent :comments link
#+HTML_HEAD: <link rel='shortcut icon' type='image/png' href='https://www.gnu.org/software/emacs/favicon.png'>
#+OPTIONS: \n:t
* Info
Here are some additional functions/macros that could help you configure Doom:

- ~load!~ for loading external *.el files relative to this one
- ~use-package~ for configuring packages
- ~after!~ for running code after a package has loaded
- ~add-load-path!~ for adding directories to the `load-path', relative to
  this file. Emacs searches the `load-path' when you load packages with
  ~require~ or `use-package'.
- ~map!~ for binding new keys

To get information about any of these functions/macros, move the cursor over
the highlighted symbol at press ~K~ (non-evil users must press ~C-c g k~).
This will open documentation for it, including demos of how they are used.

You can also try ~gd~ (or ~C-c g d~) to jump to their definition and see how
they are implemented.

** Enabling Literate Config Mode
1. Uncomment ~literate~ under ~:config~ in ~init.el~
2. Create a ~config.org~ file (like this one) in your Doom dir
3. Run ~bin/doom refresh~

* Basic Config
Make this file run (slightly) faster with lexical binding (see [[https://nullprogram.com/blog/2016/12/22/][this blog post]]
for more info).

#+BEGIN_SRC emacs-lisp
;;; config.el -*- lexical-binding: t; -*-
#+END_SRC

Place your private configuration here! Remember, you do not need to run ~doom
sync~ after modifying this file!

** User Info
#+BEGIN_SRC emacs-lisp
(setq user-full-name "jks15063"
      user-mail-address "jks15063@gmail.com")
#+END_SRC

** Fullscreen
Expand to fullscreen on start

#+BEGIN_SRC emacs-lisp
(if (eq initial-window-system 'x)
    (toggle-frame-maximized)
  (toggle-frame-fullscreen))
#+END_SRC

** Visual Settings
*** Font
Doom exposes five (optional) variables for controlling fonts in Doom. Here
are the three important ones:

+ ~doom-font~
+ ~doom-variable-pitch-font~
+ ~doom-big-font~ -- used for ~doom-big-font-mode~; use this for
  presentations or streaming.

They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
font string. You generally only need these two:

#+begin_src emacs-lisp
(setq doom-font (font-spec :family "Iosevka" :size 17))
#+end_src
*** Theme
Non-doom themes can be added in packages

#+begin_src emacs-lisp
(setq doom-theme 'doom-nord)
#+end_src
