config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-18 Wed 14:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Doom Emacs Configuration</title>
<meta name="author" content="torkable" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/png' href='https://www.gnu.org/software/emacs/favicon.png'>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Doom Emacs Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4e10ffa">1. Info</a>
<ul>
<li><a href="#org0ca61bd">1.1. Enabling Literate Config Mode</a></li>
</ul>
</li>
<li><a href="#org086ada3">2. Basic Config</a>
<ul>
<li><a href="#org2617f71">2.1. User Info</a></li>
<li><a href="#orgace8ea9">2.2. Fullscreen</a></li>
<li><a href="#org403f117">2.3. Visual Settings</a>
<ul>
<li><a href="#orgb84f98b">2.3.1. Font</a></li>
<li><a href="#orga788c58">2.3.2. Theme</a></li>
<li><a href="#org549d2bf">2.3.3. Line numbers</a></li>
<li><a href="#org421d5cd">2.3.4. Rainbow Identifiers</a></li>
<li><a href="#org794571d">2.3.5. Ligatures</a></li>
<li><a href="#orgfde296c">2.3.6. Custom Banner</a></li>
</ul>
</li>
<li><a href="#orgfd61a22">2.4. Keybinds</a>
<ul>
<li><a href="#org7d7986a">2.4.1. Local leader key</a></li>
<li><a href="#org4de3f28">2.4.2. Avy and surround setup</a></li>
<li><a href="#org6a5dfeb">2.4.3. Bind newline command</a></li>
<li><a href="#org05f57a3">2.4.4. Rebind org agenda</a></li>
<li><a href="#org09bb6bc">2.4.5. Rebind org capture</a></li>
<li><a href="#org00acd5b">2.4.6. Bind SQL-connect</a></li>
</ul>
</li>
<li><a href="#org85a472b">2.5. Misc QoL settings</a>
<ul>
<li><a href="#org65a8a5b">2.5.1. Unordered escape key sequence</a></li>
<li><a href="#org4b5cad9">2.5.2. Copy paste with middle mouse button</a></li>
<li><a href="#orge627b91">2.5.3. Global word wrap</a></li>
<li><a href="#org0ea65de">2.5.4. Treat underscore as a word character</a></li>
<li><a href="#orgd9a4018">2.5.5. VTerm</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbd45baa">3. Mode Config</a>
<ul>
<li><a href="#org9ac5443">3.1. Org mode config</a>
<ul>
<li><a href="#org37f2e04">3.1.1. Directory Setup</a></li>
<li><a href="#orgd1e0645">3.1.2. Visual Settings</a></li>
<li><a href="#orgce22136">3.1.3. GTD and Agenda Settings</a></li>
</ul>
</li>
<li><a href="#orge22a79d">3.2. SQL mode config</a>
<ul>
<li><a href="#orgd101b07">3.2.1. Set defaults</a></li>
</ul>
</li>
<li><a href="#org98cda82">3.3. Org-books config</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4e10ffa" class="outline-2">
<h2 id="org4e10ffa"><span class="section-number-2">1.</span> Info</h2>
<div class="outline-text-2" id="text-1">
<p>
Here are some additional functions/macros that could help you configure Doom:<br />
</p>

<ul class="org-ul">
<li><code>load!</code> for loading external *.el files relative to this one<br /></li>
<li><code>use-package</code> for configuring packages<br /></li>
<li><code>after!</code> for running code after a package has loaded<br /></li>
<li><code>add-load-path!</code> for adding directories to the `load-path&rsquo;, relative to<br />
this file. Emacs searches the `load-path&rsquo; when you load packages with<br />
<code>require</code> or `use-package&rsquo;.<br /></li>
<li><code>map!</code> for binding new keys<br /></li>
</ul>

<p>
To get information about any of these functions/macros, move the cursor over<br />
the highlighted symbol at press <code>K</code> (non-evil users must press <code>C-c g k</code>).<br />
This will open documentation for it, including demos of how they are used.<br />
</p>

<p>
You can also try <code>gd</code> (or <code>C-c g d</code>) to jump to their definition and see how<br />
they are implemented.<br />
</p>
</div>

<div id="outline-container-org0ca61bd" class="outline-3">
<h3 id="org0ca61bd"><span class="section-number-3">1.1.</span> Enabling Literate Config Mode</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Uncomment <code>literate</code> under <code>:config</code> in <code>init.el</code><br /></li>
<li>Create a <code>config.org</code> file (like this one) in your Doom dir<br /></li>
<li>Run <code>bin/doom refresh</code><br /></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org086ada3" class="outline-2">
<h2 id="org086ada3"><span class="section-number-2">2.</span> Basic Config</h2>
<div class="outline-text-2" id="text-2">
<p>
Make this file run (slightly) faster with lexical binding (see <a href="https://nullprogram.com/blog/2016/12/22/">this blog post</a><br />
for more info).<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #b0bec5;">;;; </span><span style="color: #b0bec5;">config.el -*- lexical-binding: t; -*-</span>
</pre>
</div>

<p>
Place your private configuration here! Remember, you do not need to run <code>doom
sync</code> after modifying this file!<br />
</p>
</div>

<div id="outline-container-org2617f71" class="outline-3">
<h3 id="org2617f71"><span class="section-number-3">2.1.</span> User Info</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">user-full-name</span> <span style="color: #9ccc65;">"jks15063"</span>
      <span style="color: #ffcc80;">user-mail-address</span> <span style="color: #9ccc65;">"jks15063@gmail.com"</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgace8ea9" class="outline-3">
<h3 id="orgace8ea9"><span class="section-number-3">2.2.</span> Fullscreen</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Expand to fullscreen on start<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">if</span> <span style="color: #2196F3;">(</span><span style="color: #8bc34a;">eq</span> <span style="color: #ffcc80;">initial-window-system</span> <span style="color: #fff59d;">'</span><span style="color: #bba699;">x</span><span style="color: #2196F3;">)</span>
    <span style="color: #2196F3;">(</span><span style="color: #84ffff;">toggle-frame-maximized</span><span style="color: #2196F3;">)</span>
  <span style="color: #2196F3;">(</span><span style="color: #84ffff;">toggle-frame-fullscreen</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org403f117" class="outline-3">
<h3 id="org403f117"><span class="section-number-3">2.3.</span> Visual Settings</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgb84f98b" class="outline-4">
<h4 id="orgb84f98b"><span class="section-number-4">2.3.1.</span> Font</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Doom exposes five (optional) variables for controlling fonts in Doom. Here<br />
are the three important ones:<br />
</p>

<ul class="org-ul">
<li><code>doom-font</code><br /></li>
<li><code>doom-variable-pitch-font</code><br /></li>
<li><code>doom-big-font</code> &#x2013; used for <code>doom-big-font-mode</code>; use this for<br />
presentations or streaming.<br /></li>
</ul>

<p>
They all accept either a font-spec, font string (&ldquo;Input Mono-12&rdquo;), or xlfd<br />
font string. You generally only need these two:<br />
</p>

<p>
I compiled a version of <code>iosevka</code> with additional special characters to support<br />
the <a href="#org794571d">Ligatures</a> added below<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">doom-font</span> <span style="color: #2196F3;">(</span><span style="color: #8bc34a;">font-spec</span> <span style="color: #ff8A65;">:family</span> <span style="color: #9ccc65;">"Iosevka"</span> <span style="color: #ff8A65;">:size</span> <span style="color: #9ccc65;">16</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga788c58" class="outline-4">
<h4 id="orga788c58"><span class="section-number-4">2.3.2.</span> Theme</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Non-doom themes can be added in packages<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">doom-theme</span> <span style="color: #fff59d;">'</span><span style="color: #c0a7bd;">material</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>
