config.html
<div id="outline-container-org549d2bf" class="outline-4">
<h4 id="org549d2bf"><span class="section-number-4">2.3.3.</span> Line numbers</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
This determines the style of line numbers in effect. If set to `nil&rsquo;, line<br />
numbers are disabled. For relative line numbers, set this to `relative&rsquo;.<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">display-line-numbers-type</span> <span style="color: #99bbb4;">t</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org421d5cd" class="outline-4">
<h4 id="org421d5cd"><span class="section-number-4">2.3.4.</span> Rainbow Identifiers</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
Rainbow identifiers in all prog modes<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">add-hook!</span> <span style="color: #c0a7bd;">prog-mode</span> <span style="color: #fff59d;">#'</span><span style="color: #ffcc80;">rainbow-identifiers-mode</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org794571d" class="outline-4">
<h4 id="org794571d"><span class="section-number-4">2.3.5.</span> Ligatures</h4>
<div class="outline-text-4" id="text-2-3-5">
<p>
The ligatures set for elixir mode make 0 sense. Remove the nonsense and setup a<br />
few arrows.<br />
</p>

<p>
Look at <code>modules/lang/elixir/config.el</code> for <code>set-pretty-symbols!</code> for list of<br />
elixir-mode symbols.<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">plist-delete!</span> <span style="color: #bb99b4;">+pretty-code-symbols</span> <span style="color: #ff8A65;">:def</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #fff59d;">plist-delete!</span> <span style="color: #bb99b4;">+pretty-code-symbols</span> <span style="color: #ff8A65;">:in</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #fff59d;">plist-delete!</span> <span style="color: #bb99b4;">+pretty-code-symbols</span> <span style="color: #ff8A65;">:for</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #fff59d;">plist-delete!</span> <span style="color: #bb99b4;">+pretty-code-symbols</span> <span style="color: #ff8A65;">:lambda</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #fff59d;">plist-delete!</span> <span style="color: #bb99b4;">+pretty-code-symbols</span> <span style="color: #ff8A65;">:yield</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #fff59d;">plist-delete!</span> <span style="color: #bb99b4;">+pretty-code-symbols</span> <span style="color: #ff8A65;">:not-in</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #fff59d;">plist-delete!</span> <span style="color: #bb99b4;">+pretty-code-symbols</span> <span style="color: #ff8A65;">:and</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #fff59d;">plist-delete!</span> <span style="color: #bb99b4;">+pretty-code-symbols</span> <span style="color: #ff8A65;">:or</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #8bc34a;">plist-put</span> <span style="color: #bb99b4;">+pretty-code-symbols</span> <span style="color: #ff8A65;">:|&gt;</span> <span style="color: #9ccc65;">#Xe142</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #8bc34a;">plist-put</span> <span style="color: #bb99b4;">+pretty-code-symbols</span> <span style="color: #ff8A65;">:-&gt;</span> <span style="color: #9ccc65;">#Xe149</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #8bc34a;">plist-put</span> <span style="color: #bb99b4;">+pretty-code-symbols</span> <span style="color: #ff8A65;">:=&gt;</span> <span style="color: #9ccc65;">#Xe161</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #8bc34a;">plist-put</span> <span style="color: #bb99b4;">+pretty-code-symbols</span> <span style="color: #ff8A65;">:&lt;-</span> <span style="color: #9ccc65;">#Xe179</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #8bc34a;">plist-put</span> <span style="color: #bb99b4;">+pretty-code-symbols</span> <span style="color: #ff8A65;">:&lt;&gt;</span> <span style="color: #9ccc65;">#Xe1c9</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #8bc34a;">plist-put</span> <span style="color: #bb99b4;">+pretty-code-symbols</span> <span style="color: #ff8A65;">:&lt;!--</span> <span style="color: #9ccc65;">#Xe10e</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #8bc34a;">plist-put</span> <span style="color: #bb99b4;">+pretty-code-symbols</span> <span style="color: #ff8A65;">:&lt;!---</span> <span style="color: #9ccc65;">#Xe10f</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfde296c" class="outline-4">
<h4 id="orgfde296c"><span class="section-number-4">2.3.6.</span> Custom Banner</h4>
<div class="outline-text-4" id="text-2-3-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">fancy-splash-image</span> <span style="color: #9ccc65;">"/home/jake/Pictures/doom-logo.png"</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfd61a22" class="outline-3">
<h3 id="orgfd61a22"><span class="section-number-3">2.4.</span> Keybinds</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org7d7986a" class="outline-4">
<h4 id="org7d7986a"><span class="section-number-4">2.4.1.</span> Local leader key</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
Set local leader key to <code>,</code><br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">doom-localleader-key</span> <span style="color: #9ccc65;">","</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4de3f28" class="outline-4">
<h4 id="org4de3f28"><span class="section-number-4">2.4.2.</span> Avy and surround setup</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
For the last few years on <code>spacemacs</code>, I had moved surround to <code>S</code> and had<br />
<code>avy-goto-char-timer</code> set to <code>s</code>. But by default, Doom emacs replaces <code>s</code> and<br />
<code>S</code> with <code>evil snipe</code>, which is similar, but not what I want, so lets turn it<br />
off:<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #84ffff;">remove-hook</span> <span style="color: #fff59d;">'</span><span style="color: #ffcc80;">doom-first-input-hook</span> <span style="color: #fff59d;">#'</span><span style="color: #ffcc80;">evil-snipe-mode</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<p>
Map <code>avy-goto-char-timer</code> to <code>s</code> and <code>avy-goto-line</code> to <code>C-;</code>:<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">evil-define-key</span> <span style="color: #fff59d;">'</span><span style="color: #2196F3;">(</span><span style="color: #9999bb;">normal</span> <span style="color: #c0afa7;">motion</span><span style="color: #2196F3;">)</span> <span style="color: #ffcc80;">global-map</span> <span style="color: #9ccc65;">"s"</span> <span style="color: #fff59d;">'</span><span style="color: #bb99b4;">avy-goto-char-timer</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #fff59d;">evil-define-key</span> <span style="color: #fff59d;">'</span><span style="color: #2196F3;">(</span><span style="color: #a6bb99;">visual</span> <span style="color: #c0afa7;">operator</span><span style="color: #2196F3;">)</span> <span style="color: #ffcc80;">evil-surround-mode-map</span> <span style="color: #9ccc65;">"s"</span> <span style="color: #fff59d;">'</span><span style="color: #bb99b4;">avy-goto-char-timer</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #fff59d;">evil-define-key</span> <span style="color: #fff59d;">'</span><span style="color: #2196F3;">(</span><span style="color: #9999bb;">normal</span> <span style="color: #c0afa7;">motion</span> <span style="color: #a6bb99;">visual</span> <span style="color: #c0afa7;">operator</span><span style="color: #2196F3;">)</span> <span style="color: #ffcc80;">global-map</span> <span style="color: #2196F3;">(</span><span style="color: #84ffff;">kbd</span> <span style="color: #9ccc65;">"C-;"</span><span style="color: #2196F3;">)</span> <span style="color: #fff59d;">'</span><span style="color: #c0afa7;">avy-goto-line</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<p>
And move surround to <code>S</code>:<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">evil-define-key</span> <span style="color: #fff59d;">'</span><span style="color: #c0afa7;">operator</span> <span style="color: #ffcc80;">evil-surround-mode-map</span> <span style="color: #9ccc65;">"S"</span> <span style="color: #fff59d;">'</span><span style="color: #c0afa7;">evil-surround-edit</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #fff59d;">evil-define-key</span> <span style="color: #fff59d;">'</span><span style="color: #a6bb99;">visual</span> <span style="color: #ffcc80;">evil-surround-mode-map</span> <span style="color: #9ccc65;">"S"</span> <span style="color: #fff59d;">'</span><span style="color: #e0d0a0;">evil-surround-region</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>
