config.md


<a id="org7bbf73f"></a>

### Line numbers

This determines the style of line numbers in effect. If set to \`nil&rsquo;, line  
numbers are disabled. For relative line numbers, set this to \`relative&rsquo;.  

    (setq display-line-numbers-type t)


<a id="org2262ecc"></a>

### Rainbow Identifiers

Rainbow identifiers in all prog modes  

    (add-hook! prog-mode #'rainbow-identifiers-mode)


<a id="orgfbcfeb8"></a>

### Ligatures

The ligatures set for elixir mode make 0 sense. Remove the nonsense and setup a  
few arrows.  

Look at `modules/lang/elixir/config.el` for `set-pretty-symbols!` for list of  
elixir-mode symbols.  

    (plist-delete! +pretty-code-symbols :def)
    (plist-delete! +pretty-code-symbols :in)
    (plist-delete! +pretty-code-symbols :for)
    (plist-delete! +pretty-code-symbols :lambda)
    (plist-delete! +pretty-code-symbols :yield)
    (plist-delete! +pretty-code-symbols :not-in)
    (plist-delete! +pretty-code-symbols :and)
    (plist-delete! +pretty-code-symbols :or)
    (plist-put +pretty-code-symbols :|> #Xe142)
    (plist-put +pretty-code-symbols :-> #Xe149)
    (plist-put +pretty-code-symbols :=> #Xe161)
    (plist-put +pretty-code-symbols :<- #Xe179)
    (plist-put +pretty-code-symbols :<> #Xe1c9)
    (plist-put +pretty-code-symbols :<!-- #Xe10e)
    (plist-put +pretty-code-symbols :<!--- #Xe10f)


<a id="org6f163f9"></a>

### Custom Banner

    (setq fancy-splash-image "/home/jake/Pictures/doom-logo.png")


<a id="orgf7feaf4"></a>

## Keybinds


<a id="org371d014"></a>

### Local leader key

Set local leader key to `,`  

    (setq doom-localleader-key ",")


<a id="org80b8fd8"></a>

### Avy and surround setup

For the last few years on `spacemacs`, I had moved surround to `S` and had  
`avy-goto-char-timer` set to `s`. But by default, Doom emacs replaces `s` and  
`S` with `evil snipe`, which is similar, but not what I want, so lets turn it  
off:  

    (remove-hook 'doom-first-input-hook #'evil-snipe-mode)

Map `avy-goto-char-timer` to `s` and `avy-goto-line` to `C-;`:  

    (evil-define-key '(normal motion) global-map "s" 'avy-goto-char-timer)
    (evil-define-key '(visual operator) evil-surround-mode-map "s" 'avy-goto-char-timer)
    (evil-define-key '(normal motion visual operator) global-map (kbd "C-;") 'avy-goto-line)

And move surround to `S`:  

    (evil-define-key 'operator evil-surround-mode-map "S" 'evil-surround-edit)
    (evil-define-key 'visual evil-surround-mode-map "S" 'evil-surround-region)
