config.org
*** Bind newline command
#+BEGIN_SRC emacs-lisp
(map! :leader "j n" #'sp-newline)
#+END_SRC

*** Rebind org agenda
The default sub-group is completely redundant, all the cmds are already
available on the agenda.
#+BEGIN_SRC emacs-lisp
(map! :leader "o a" #'org-agenda)
#+END_SRC

*** Rebind org capture
By default on =SPC X=, going to overwrite =SPC x= because scratch buffer is
still easy to get to with =SPC b x=.

#+BEGIN_SRC emacs-lisp
(map! :leader "x" #'org-capture)
#+END_SRC

*** Bind SQL-connect
Connect to one of the db connections defined in ~sql-connection-alist~

#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "SQL Connections"
      "o s" #'sql-connect)
#+END_SRC

*** Bind custom RDS connect function
#+begin_src emacs-lisp
(map! :leader
      (:prefix ("a" . "AWS")
      :desc "Cars prod db - read only"
      "r" #'cars-prod-db-read-only))
#+end_src
*** Bind restclient functions so they're easy to use with babel
#+begin_src emacs-lisp
(map! :leader
      (:prefix ("R" . "restclient")
      :desc "send current"
      "s" #'restclient-http-send-current))
#+end_src

*** Bind extra fold functions
#+begin_src emacs-lisp
(map! :leader
      (:prefix ("c F" . "fold")
       :desc "close fold"
       "c" #'+fold/close))
#+end_src

#+begin_src emacs-lisp
(map! :leader
      :desc "open fold"
      "c F o" #'+fold/open)
#+end_src

** Misc QoL settings
*** Unordered escape key sequence
So I can just mash ~jk~ without thinking

#+BEGIN_SRC emacs-lisp
(setq evil-escape-unordered-key-sequence t)
#+END_SRC

*** Copy paste with middle mouse button
#+BEGIN_SRC emacs-lisp
(setq xterm-mouse-mode -1)
#+END_SRC

*** Global word wrap
#+BEGIN_SRC emacs-lisp
(+global-word-wrap-mode +1)
#+END_SRC

*** Treat underscore as a word character
#+BEGIN_SRC emacs-lisp
;; For elixir
(add-hook! 'elixir-mode-hook (modify-syntax-entry ?_ "w"))
#+END_SRC

*** VTerm
#+BEGIN_SRC emacs-lisp
(setq vterm-module-cmake-args "-DUSE_SYSTEM_LIBVTERM=yes")
#+END_SRC

* Mode Config
** Org mode config
*** Directory Setup
**** Org directory
Set the base org mode directory

#+BEGIN_SRC emacs-lisp
(setq org-directory "~/Dropbox/org/gtd/")
#+END_SRC

**** GTD agenda files
#+BEGIN_SRC emacs-lisp
(setq org-agenda-files '("~/Dropbox/org/gtd/inbox.org"
                         "~/Dropbox/org/gtd/gtd.org"
                         "~/Dropbox/org/gtd/cars.org"
                         "~/Dropbox/org/gtd/tickler.org"))
#+END_SRC

**** Refile targets
#+BEGIN_SRC emacs-lisp
(setq org-refile-targets '(("~/Dropbox/org/gtd/gtd.org" :maxlevel . 3)
                           ("~/Dropbox/org/gtd/someday.org" :level . 1)
                           ("~/Dropbox/org/gtd/cars.org" :level . 1)
                           ("~/Dropbox/org/gtd/tickler.org" :maxlevel . 2)))
#+END_SRC

Allow the creation of new parent nodes while refiling. This means “allow me to
tack new heading names onto the end of my outline path, and if I am asking to
create new ones, make me confirm it.”
#+BEGIN_SRC emacs-lisp
(setq org-refile-allow-creating-parent-nodes 'confirm)
#+END_SRC

