config.html

<div id="outline-container-org6a5dfeb" class="outline-4">
<h4 id="org6a5dfeb"><span class="section-number-4">2.4.3.</span> Bind newline command</h4>
<div class="outline-text-4" id="text-2-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">map!</span> <span style="color: #ff8A65;">:leader</span> <span style="color: #9ccc65;">"j n"</span> <span style="color: #fff59d;">#'</span><span style="color: #c0afa7;">sp-newline</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org05f57a3" class="outline-4">
<h4 id="org05f57a3"><span class="section-number-4">2.4.4.</span> Rebind org agenda</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
The default sub-group is completely redundant, all the cmds are already<br />
available on the agenda.<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">map!</span> <span style="color: #ff8A65;">:leader</span> <span style="color: #9ccc65;">"o a"</span> <span style="color: #fff59d;">#'</span><span style="color: #c0a7bd;">org-agenda</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org09bb6bc" class="outline-4">
<h4 id="org09bb6bc"><span class="section-number-4">2.4.5.</span> Rebind org capture</h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
By default on <code>SPC X</code>, going to overwrite <code>SPC x</code> because scratch buffer is<br />
still easy to get to with <code>SPC b x</code>.<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">map!</span> <span style="color: #ff8A65;">:leader</span> <span style="color: #9ccc65;">"x"</span> <span style="color: #fff59d;">#'</span><span style="color: #a0d6e0;">org-capture</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org00acd5b" class="outline-4">
<h4 id="org00acd5b"><span class="section-number-4">2.4.6.</span> Bind SQL-connect</h4>
<div class="outline-text-4" id="text-2-4-6">
<p>
Connect to one of the db connections defined in <code>sql-connection-alist</code><br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">map!</span> <span style="color: #ff8A65;">:leader</span> <span style="color: #9ccc65;">"o s"</span> <span style="color: #fff59d;">#'</span><span style="color: #bb99b4;">sql-connect</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org85a472b" class="outline-3">
<h3 id="org85a472b"><span class="section-number-3">2.5.</span> Misc QoL settings</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org65a8a5b" class="outline-4">
<h4 id="org65a8a5b"><span class="section-number-4">2.5.1.</span> Unordered escape key sequence</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
So I can just mash <code>jk</code> without thinking<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">evil-escape-unordered-key-sequence</span> <span style="color: #99bbb4;">t</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4b5cad9" class="outline-4">
<h4 id="org4b5cad9"><span class="section-number-4">2.5.2.</span> Copy paste with middle mouse button</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">xterm-mouse-mode</span> <span style="color: #9ccc65;">-1</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge627b91" class="outline-4">
<h4 id="orge627b91"><span class="section-number-4">2.5.3.</span> Global word wrap</h4>
<div class="outline-text-4" id="text-2-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #ffcc80;">+global-word-wrap-mode</span> <span style="color: #9ccc65;">+1</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0ea65de" class="outline-4">
<h4 id="org0ea65de"><span class="section-number-4">2.5.4.</span> Treat underscore as a word character</h4>
<div class="outline-text-4" id="text-2-5-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">For elixir</span>
<span style="color: #e91e63;">(</span><span style="color: #fff59d;">add-hook!</span> <span style="color: #fff59d;">'</span><span style="color: #ffcc80;">elixir-mode-hook</span> <span style="color: #2196F3;">(</span><span style="color: #8bc34a;">modify-syntax-entry</span> <span style="color: #c0afa7;">?_</span> <span style="color: #9ccc65;">"w"</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd9a4018" class="outline-4">
<h4 id="orgd9a4018"><span class="section-number-4">2.5.5.</span> VTerm</h4>
<div class="outline-text-4" id="text-2-5-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #bb99b4;">vterm-module-cmake-args</span> <span style="color: #9ccc65;">"-DUSE_SYSTEM_LIBVTERM=yes"</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbd45baa" class="outline-2">
<h2 id="orgbd45baa"><span class="section-number-2">3.</span> Mode Config</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9ac5443" class="outline-3">
<h3 id="org9ac5443"><span class="section-number-3">3.1.</span> Org mode config</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org37f2e04" class="outline-4">
<h4 id="org37f2e04"><span class="section-number-4">3.1.1.</span> Directory Setup</h4>
<div class="outline-text-4" id="text-3-1-1">
</div>
<ol class="org-ol">
<li><a id="orgff1c897"></a>Org directory<br />
<div class="outline-text-5" id="text-3-1-1-1">
<p>
Set the base org mode directory<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-directory</span> <span style="color: #9ccc65;">"~/Dropbox/org/gtd/"</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org26cfff2"></a>Roam directory<br />
<div class="outline-text-5" id="text-3-1-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #a6bb99;">org-roam-directory</span> <span style="color: #9ccc65;">"~/Dropbox/org/roam"</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orge7ab897"></a>GTD agenda files<br />
<div class="outline-text-5" id="text-3-1-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-agenda-files</span> <span style="color: #fff59d;">'</span><span style="color: #2196F3;">(</span><span style="color: #9ccc65;">"~/Dropbox/org/gtd/inbox.org"</span>
                         <span style="color: #9ccc65;">"~/Dropbox/org/gtd/gtd.org"</span>
                         <span style="color: #9ccc65;">"~/Dropbox/org/gtd/cars.org"</span>
                         <span style="color: #9ccc65;">"~/Dropbox/org/gtd/tickler.org"</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org7fff259"></a>Refile targets<br />
<div class="outline-text-5" id="text-3-1-1-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-refile-targets</span> <span style="color: #fff59d;">'</span><span style="color: #2196F3;">(</span><span style="color: #EF6C00;">(</span><span style="color: #9ccc65;">"~/Dropbox/org/gtd/gtd.org"</span> <span style="color: #ff8A65;">:maxlevel</span> <span style="color: #a6bb99;">.</span> <span style="color: #9ccc65;">3</span><span style="color: #EF6C00;">)</span>
                           <span style="color: #EF6C00;">(</span><span style="color: #9ccc65;">"~/Dropbox/org/gtd/someday.org"</span> <span style="color: #ff8A65;">:level</span> <span style="color: #a6bb99;">.</span> <span style="color: #9ccc65;">1</span><span style="color: #EF6C00;">)</span>
                           <span style="color: #EF6C00;">(</span><span style="color: #9ccc65;">"~/Dropbox/org/gtd/cars.org"</span> <span style="color: #ff8A65;">:level</span> <span style="color: #a6bb99;">.</span> <span style="color: #9ccc65;">1</span><span style="color: #EF6C00;">)</span>
                           <span style="color: #EF6C00;">(</span><span style="color: #9ccc65;">"~/Dropbox/org/gtd/tickler.org"</span> <span style="color: #ff8A65;">:maxlevel</span> <span style="color: #a6bb99;">.</span> <span style="color: #9ccc65;">2</span><span style="color: #EF6C00;">)</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<p>
Allow the creation of new parent nodes while refiling. This means “allow me to<br />
tack new heading names onto the end of my outline path, and if I am asking to<br />
create new ones, make me confirm it.”<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-refile-allow-creating-parent-nodes</span> <span style="color: #fff59d;">'</span><span style="color: #c0a7bd;">confirm</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</li>
