config.md


<a id="org2aa2ac1"></a>

### Bind newline command

    (map! :leader "j n" #'sp-newline)


<a id="orgd47d73c"></a>

### Rebind org agenda

The default sub-group is completely redundant, all the cmds are already  
available on the agenda.  

    (map! :leader "o a" #'org-agenda)


<a id="org3aec7b0"></a>

### Rebind org capture

By default on `SPC X`, going to overwrite `SPC x` because scratch buffer is  
still easy to get to with `SPC b x`.  

    (map! :leader "x" #'org-capture)


<a id="orgd8d3eab"></a>

### Bind SQL-connect

Connect to one of the db connections defined in `sql-connection-alist`  

    (map! :leader "o s" #'sql-connect)


<a id="orgf3da6cc"></a>

## Misc QoL settings


<a id="orgf7b0fa5"></a>

### Unordered escape key sequence

So I can just mash `jk` without thinking  

    (setq evil-escape-unordered-key-sequence t)


<a id="org91a933c"></a>

### Copy paste with middle mouse button

    (setq xterm-mouse-mode -1)


<a id="org94fa3f3"></a>

### Global word wrap

    (+global-word-wrap-mode +1)


<a id="org8a5acbc"></a>

### Treat underscore as a word character

    ;; For elixir
    (add-hook! 'elixir-mode-hook (modify-syntax-entry ?_ "w"))


<a id="orgdb8412a"></a>

### VTerm

    (setq vterm-module-cmake-args "-DUSE_SYSTEM_LIBVTERM=yes")


<a id="orgfbbbcdb"></a>

# Mode Config


<a id="org7232d32"></a>

## Org mode config


<a id="orga218aca"></a>

### Directory Setup

1.  Org directory

    Set the base org mode directory  
    
        (setq org-directory "~/Dropbox/org/gtd/")

2.  Roam directory

        (setq org-roam-directory "~/Dropbox/org/roam")

3.  GTD agenda files

        (setq org-agenda-files '("~/Dropbox/org/gtd/inbox.org"
                                 "~/Dropbox/org/gtd/gtd.org"
                                 "~/Dropbox/org/gtd/cars.org"
                                 "~/Dropbox/org/gtd/tickler.org"))

4.  Refile targets

        (setq org-refile-targets '(("~/Dropbox/org/gtd/gtd.org" :maxlevel . 3)
                                   ("~/Dropbox/org/gtd/someday.org" :level . 1)
                                   ("~/Dropbox/org/gtd/cars.org" :level . 1)
                                   ("~/Dropbox/org/gtd/tickler.org" :maxlevel . 2)))
    
    Allow the creation of new parent nodes while refiling. This means “allow me to  
    tack new heading names onto the end of my outline path, and if I am asking to  
    create new ones, make me confirm it.”  
    
        (setq org-refile-allow-creating-parent-nodes 'confirm)

5.  Diary Settings
