config.org
**** Diary Settings
Set the diary file, exclude it from our agenda, and insert timestamps on creation.

#+BEGIN_SRC emacs-lisp
(setq org-agenda-diary-file "~/Dropbox/org/gtd/diary.org")
(setq org-agenda-include-diary nil)
(setq org-agenda-insert-diary-extract-time t)
#+END_SRC
*** Visual Settings
**** Set checkbox statistics face to orange
The pure red is a bit much, still need to lower the brightness though

#+BEGIN_SRC emacs-lisp
(after! org
  (set-face-attribute 'org-checkbox-statistics-todo nil :background "#FF5722"))
#+END_SRC

**** Set done todo face to grey
They are grey by default in Doom emacs, but somewhere, somehow, they got set to orange.

#+BEGIN_SRC emacs-lisp
(after! org
  (set-face-attribute 'org-headline-done nil :foreground "grey"))
#+END_SRC

**** Todo Keyword Face Colors
#+BEGIN_SRC emacs-lisp
(after! org
  (setq org-todo-keyword-faces
        (quote (("TODO" :foreground "#FF5722" :weight bold)
                ;; ("NEXT" :foreground "#2196F3" :weight bold)
                ("DONE" :foreground "#4CAF50" :weight bold)
                ("WAITING" :foreground "orange" :weight bold)
                ;; ("HOLD" :foreground "#E040FB" :weight bold)
                ("CANCELLED" :foreground "#4CAF50" :weight bold)))))
#+END_SRC

**** Inline images on load
not working, add ~#+STARTUP: inlineimages~ to org file
#+BEGIN_SRC emacs-lisp :tangle no
(after! org
  (setq org-startup-with-inline-images t))
#+END_SRC

*** GTD and Agenda Settings
