config.html

<li><a id="org8ed7b7f"></a>Diary Settings<br />
<div class="outline-text-5" id="text-3-1-1-5">
<p>
Set the diary file, exclude it from our agenda, and insert timestamps on creation.<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-agenda-diary-file</span> <span style="color: #9ccc65;">"~/Dropbox/org/gtd/diary.org"</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-agenda-include-diary</span> <span style="color: #e0d0a0;">nil</span><span style="color: #e91e63;">)</span>
<span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-agenda-insert-diary-extract-time</span> <span style="color: #99bbb4;">t</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgd1e0645" class="outline-4">
<h4 id="orgd1e0645"><span class="section-number-4">3.1.2.</span> Visual Settings</h4>
<div class="outline-text-4" id="text-3-1-2">
</div>
<ol class="org-ol">
<li><a id="org2f62964"></a>Set checkbox statistics face to orange<br />
<div class="outline-text-5" id="text-3-1-2-1">
<p>
The pure red is a bit much, still need to lower the brightness though<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">after!</span> <span style="color: #a7aac0;">org</span>
  <span style="color: #2196F3;">(</span><span style="color: #84ffff;">set-face-attribute</span> <span style="color: #fff59d;">'</span><span style="color: #b6a0e0;">org-checkbox-statistics-todo</span> <span style="color: #e0d0a0;">nil</span> <span style="color: #ff8A65;">:background</span> <span style="color: #9ccc65;">"#FF5722"</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgeca2441"></a>Set done todo face to grey<br />
<div class="outline-text-5" id="text-3-1-2-2">
<p>
They are grey by default in Doom emacs, but somewhere, somehow, they got set to orange.<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">after!</span> <span style="color: #a7aac0;">org</span>
  <span style="color: #2196F3;">(</span><span style="color: #84ffff;">set-face-attribute</span> <span style="color: #fff59d;">'</span><span style="color: #bba699;">org-headline-done</span> <span style="color: #e0d0a0;">nil</span> <span style="color: #ff8A65;">:foreground</span> <span style="color: #9ccc65;">"grey"</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org9617e31"></a>Todo Keyword Face Colors<br />
<div class="outline-text-5" id="text-3-1-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">after!</span> <span style="color: #a7aac0;">org</span>
  <span style="color: #2196F3;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-todo-keyword-faces</span>
        <span style="color: #EF6C00;">(</span><span style="color: #fff59d;">quote</span> <span style="color: #B388FF;">(</span><span style="color: #e91e63;">(</span><span style="color: #9ccc65;">"</span><span style="color: #ff9800; font-weight: bold;">TODO</span><span style="color: #9ccc65;">"</span> <span style="color: #ff8A65;">:foreground</span> <span style="color: #9ccc65;">"#FF5722"</span> <span style="color: #ff8A65;">:weight</span> <span style="color: #c0afa7;">bold</span><span style="color: #e91e63;">)</span>
                <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">("NEXT" :foreground "#2196F3" :weight bold)</span>
                <span style="color: #e91e63;">(</span><span style="color: #9ccc65;">"DONE"</span> <span style="color: #ff8A65;">:foreground</span> <span style="color: #9ccc65;">"#4CAF50"</span> <span style="color: #ff8A65;">:weight</span> <span style="color: #c0afa7;">bold</span><span style="color: #e91e63;">)</span>
                <span style="color: #e91e63;">(</span><span style="color: #9ccc65;">"WAITING"</span> <span style="color: #ff8A65;">:foreground</span> <span style="color: #9ccc65;">"orange"</span> <span style="color: #ff8A65;">:weight</span> <span style="color: #c0afa7;">bold</span><span style="color: #e91e63;">)</span>
                <span style="color: #b0bec5;">;; </span><span style="color: #b0bec5;">("HOLD" :foreground "#E040FB" :weight bold)</span>
                <span style="color: #e91e63;">(</span><span style="color: #9ccc65;">"CANCELLED"</span> <span style="color: #ff8A65;">:foreground</span> <span style="color: #9ccc65;">"#4CAF50"</span> <span style="color: #ff8A65;">:weight</span> <span style="color: #c0afa7;">bold</span><span style="color: #e91e63;">)</span><span style="color: #B388FF;">)</span><span style="color: #EF6C00;">)</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgdc80d8a"></a>Inline images on load<br />
<div class="outline-text-5" id="text-3-1-2-4">
<p>
not working, add <code>#+STARTUP: inlineimages</code> to org file<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">after!</span> <span style="color: #a7aac0;">org</span>
  <span style="color: #2196F3;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-startup-with-inline-images</span> <span style="color: #99bbb4;">t</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgce22136" class="outline-4">
<h4 id="orgce22136"><span class="section-number-4">3.1.3.</span> GTD and Agenda Settings</h4>
<div class="outline-text-4" id="text-3-1-3">
</div>
<ol class="org-ol">
