config.md

    Set the diary file, exclude it from our agenda, and insert timestamps on creation.  
    
        (setq org-agenda-diary-file "~/Dropbox/org/gtd/diary.org")
        (setq org-agenda-include-diary nil)
        (setq org-agenda-insert-diary-extract-time t)


<a id="org5388fe7"></a>

### Visual Settings

1.  Set checkbox statistics face to orange

    The pure red is a bit much, still need to lower the brightness though  
    
        (after! org
          (set-face-attribute 'org-checkbox-statistics-todo nil :background "#FF5722"))

2.  Set done todo face to grey

    They are grey by default in Doom emacs, but somewhere, somehow, they got set to orange.  
    
        (after! org
          (set-face-attribute 'org-headline-done nil :foreground "grey"))

3.  Todo Keyword Face Colors

        (after! org
          (setq org-todo-keyword-faces
                (quote (("TODO" :foreground "#FF5722" :weight bold)
                        ;; ("NEXT" :foreground "#2196F3" :weight bold)
                        ("DONE" :foreground "#4CAF50" :weight bold)
                        ("WAITING" :foreground "orange" :weight bold)
                        ;; ("HOLD" :foreground "#E040FB" :weight bold)
                        ("CANCELLED" :foreground "#4CAF50" :weight bold)))))

4.  Inline images on load

    not working, add `#+STARTUP: inlineimages` to org file  
    
        (after! org
          (setq org-startup-with-inline-images t))


<a id="org79e2455"></a>

### GTD and Agenda Settings
