config.html
<li><a id="orgc08d0dd"></a>Custom agenda commands<br />
<div class="outline-text-5" id="text-3-1-3-1">
<ul class="org-ul">
<li>This custom cmd was borrowed from <a href="https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html">Nicolas Petton&rsquo;s GTD with emacs breakdown</a>. It filters the todo list down to the first <code>todo</code> tasks tagged <code>@work</code>.<br /></li>
</ul>

<p>
Never use this and not sure how to use it, should remove this.<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">after!</span> <span style="color: #a7aac0;">org</span>
  <span style="color: #2196F3;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-agenda-custom-commands</span>
        <span style="color: #fff59d;">'</span><span style="color: #EF6C00;">(</span><span style="color: #B388FF;">(</span><span style="color: #9ccc65;">"w"</span> <span style="color: #9ccc65;">"Work"</span> <span style="color: #c0a7bd;">tags-todo</span> <span style="color: #9ccc65;">"@work"</span>
           <span style="color: #e91e63;">(</span><span style="color: #2196F3;">(</span><span style="color: #ffcc80;">org-agenda-overriding-header</span> <span style="color: #9ccc65;">"Work"</span><span style="color: #2196F3;">)</span>
            <span style="color: #2196F3;">(</span><span style="color: #ffcc80;">org-agenda-skip-function</span> <span style="color: #fff59d;">#'</span><span style="color: #bb99b4;">my-org-agenda-skip-all-siblings-but-first</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span><span style="color: #B388FF;">)</span><span style="color: #EF6C00;">)</span><span style="color: #2196F3;">)</span>

  <span style="color: #2196F3;">(</span><span style="color: #fff59d;">defun</span> <span style="color: #84ffff;">my-org-agenda-skip-all-siblings-but-first</span> <span style="color: #EF6C00;">()</span>
    <span style="color: #ffe4b5;">"Skip all but the first non-done entry."</span>
    <span style="color: #EF6C00;">(</span><span style="color: #fff59d;">let</span> <span style="color: #B388FF;">(</span><span style="color: #99bbb4;">should-skip-entry</span><span style="color: #B388FF;">)</span>
      <span style="color: #B388FF;">(</span><span style="color: #fff59d;">unless</span> <span style="color: #e91e63;">(</span><span style="color: #84ffff;">org-current-is-todo</span><span style="color: #e91e63;">)</span>
        <span style="color: #e91e63;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #99bbb4;">should-skip-entry</span> <span style="color: #99bbb4;">t</span><span style="color: #e91e63;">)</span><span style="color: #B388FF;">)</span>
      <span style="color: #B388FF;">(</span><span style="color: #fff59d;">save-excursion</span>
        <span style="color: #e91e63;">(</span><span style="color: #fff59d;">while</span> <span style="color: #2196F3;">(</span><span style="color: #fff59d;">and</span> <span style="color: #EF6C00;">(</span><span style="color: #8bc34a;">not</span> <span style="color: #99bbb4;">should-skip-entry</span><span style="color: #EF6C00;">)</span> <span style="color: #EF6C00;">(</span><span style="color: #84ffff;">org-goto-sibling</span> <span style="color: #99bbb4;">t</span><span style="color: #EF6C00;">)</span><span style="color: #2196F3;">)</span>
          <span style="color: #2196F3;">(</span><span style="color: #fff59d;">when</span> <span style="color: #EF6C00;">(</span><span style="color: #84ffff;">org-current-is-todo</span><span style="color: #EF6C00;">)</span>
            <span style="color: #EF6C00;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #99bbb4;">should-skip-entry</span> <span style="color: #99bbb4;">t</span><span style="color: #EF6C00;">)</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span><span style="color: #B388FF;">)</span>
      <span style="color: #B388FF;">(</span><span style="color: #fff59d;">when</span> <span style="color: #99bbb4;">should-skip-entry</span>
        <span style="color: #e91e63;">(</span><span style="color: #fff59d;">or</span> <span style="color: #2196F3;">(</span><span style="color: #84ffff;">outline-next-heading</span><span style="color: #2196F3;">)</span>
            <span style="color: #2196F3;">(</span><span style="color: #8bc34a;">goto-char</span> <span style="color: #EF6C00;">(</span><span style="color: #8bc34a;">point-max</span><span style="color: #EF6C00;">)</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span><span style="color: #B388FF;">)</span><span style="color: #EF6C00;">)</span><span style="color: #2196F3;">)</span>

  <span style="color: #2196F3;">(</span><span style="color: #fff59d;">defun</span> <span style="color: #84ffff;">org-current-is-todo</span> <span style="color: #EF6C00;">()</span>
    <span style="color: #EF6C00;">(</span><span style="color: #8bc34a;">string=</span> <span style="color: #9ccc65;">"</span><span style="color: #ff9800; font-weight: bold;">TODO</span><span style="color: #9ccc65;">"</span> <span style="color: #B388FF;">(</span><span style="color: #84ffff;">org-get-todo-state</span><span style="color: #B388FF;">)</span><span style="color: #EF6C00;">)</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgdf39d55"></a>Todo Keywords<br />
<div class="outline-text-5" id="text-3-1-3-2">
<p>
Set up todo keyword workflow<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">after!</span> <span style="color: #a7aac0;">org</span>
  <span style="color: #2196F3;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-todo-keywords</span> <span style="color: #fff59d;">'</span><span style="color: #EF6C00;">(</span><span style="color: #B388FF;">(</span><span style="color: #99bbb4;">sequence</span> <span style="color: #9ccc65;">"</span><span style="color: #ff9800; font-weight: bold;">TODO</span><span style="color: #9ccc65;">(t)"</span> <span style="color: #9ccc65;">"WAITING(w@)"</span> <span style="color: #9ccc65;">"|"</span> <span style="color: #9ccc65;">"DONE(d)"</span> <span style="color: #9ccc65;">"CANCELLED(c@)"</span><span style="color: #B388FF;">)</span><span style="color: #EF6C00;">)</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org31f7007"></a>Capture Templates<br />
<div class="outline-text-5" id="text-3-1-3-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">after!</span> <span style="color: #a7aac0;">org</span>
  <span style="color: #2196F3;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-capture-templates</span> <span style="color: #fff59d;">'</span><span style="color: #EF6C00;">(</span><span style="color: #B388FF;">(</span><span style="color: #9ccc65;">"t"</span> <span style="color: #9ccc65;">"Todo [inbox]"</span> <span style="color: #c0afa7;">entry</span> <span style="color: #e91e63;">(</span><span style="color: #bb99b4;">file+headline</span> <span style="color: #9ccc65;">"~/Dropbox/org/gtd/inbox.org"</span> <span style="color: #9ccc65;">"Tasks"</span><span style="color: #e91e63;">)</span> <span style="color: #9ccc65;">"* </span><span style="color: #ff9800; font-weight: bold;">TODO</span><span style="color: #9ccc65;"> %i%?\n"</span><span style="color: #B388FF;">)</span>
                                <span style="color: #B388FF;">(</span><span style="color: #9ccc65;">"T"</span> <span style="color: #9ccc65;">"Tickler"</span> <span style="color: #c0afa7;">entry</span> <span style="color: #e91e63;">(</span><span style="color: #bb99b4;">file+headline</span> <span style="color: #9ccc65;">"~/Dropbox/org/gtd/tickler.org"</span> <span style="color: #9ccc65;">"Tickler"</span><span style="color: #e91e63;">)</span> <span style="color: #9ccc65;">"* %i%? \n %U"</span><span style="color: #B388FF;">)</span>
                                <span style="color: #B388FF;">(</span><span style="color: #9ccc65;">"j"</span> <span style="color: #9ccc65;">"Journal"</span> <span style="color: #c0afa7;">entry</span> <span style="color: #e91e63;">(</span><span style="color: #e0d0a0;">file+datetree</span> <span style="color: #9ccc65;">"~/Dropbox/org/gtd/diary.org"</span><span style="color: #e91e63;">)</span> <span style="color: #9ccc65;">"* %?\n%U\n"</span><span style="color: #B388FF;">)</span>
                                <span style="color: #B388FF;">(</span><span style="color: #9ccc65;">"h"</span> <span style="color: #9ccc65;">"habit"</span> <span style="color: #c0afa7;">entry</span> <span style="color: #e91e63;">(</span><span style="color: #e0a0bc;">file</span> <span style="color: #9ccc65;">"~/Dropbox/org/gtd/inbox.org"</span><span style="color: #e91e63;">)</span>
                                 <span style="color: #9ccc65;">"* </span><span style="color: #ff9800; font-weight: bold;">TODO</span><span style="color: #9ccc65;"> %?\nSCHEDULED: %(format-time-string \"%&lt;&lt;%Y-%m-%d %a .+1d/3d&gt;&gt;\")\n:PROPERTIES:\n:STYLE: habit \n:END:\n%U\n"</span><span style="color: #B388FF;">)</span>
                                <span style="color: #B388FF;">(</span><span style="color: #9ccc65;">"n"</span> <span style="color: #9ccc65;">"Note"</span> <span style="color: #c0afa7;">entry</span> <span style="color: #e91e63;">(</span><span style="color: #bb99b4;">file+headline</span> <span style="color: #9ccc65;">"~/Dropbox/org/gtd/inbox.org"</span> <span style="color: #9ccc65;">"Notes"</span><span style="color: #e91e63;">)</span> <span style="color: #9ccc65;">"* %? :</span><span style="color: #4eee94; font-weight: bold;">NOTE:</span><span style="color: #9ccc65;">\n%U\n"</span><span style="color: #B388FF;">)</span><span style="color: #EF6C00;">)</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org06d8cbb"></a>Remove scheduled headlines and deadlines from the agenda once they&rsquo;re marked done<br />
<div class="outline-text-5" id="text-3-1-3-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">after!</span> <span style="color: #a7aac0;">org</span>
  <span style="color: #2196F3;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-agenda-skip-scheduled-if-done</span> <span style="color: #99bbb4;">t</span><span style="color: #2196F3;">)</span>
  <span style="color: #2196F3;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-agenda-skip-deadline-if-done</span> <span style="color: #99bbb4;">t</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</li>
