config.md

1.  Custom agenda commands

    -   This custom cmd was borrowed from [Nicolas Petton&rsquo;s GTD with emacs breakdown](https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html). It filters the todo list down to the first `todo` tasks tagged `@work`.
    
    Never use this and not sure how to use it, should remove this.  
    
        (after! org
          (setq org-agenda-custom-commands
                '(("w" "Work" tags-todo "@work"
                   ((org-agenda-overriding-header "Work")
                    (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))))
        
          (defun my-org-agenda-skip-all-siblings-but-first ()
            "Skip all but the first non-done entry."
            (let (should-skip-entry)
              (unless (org-current-is-todo)
                (setq should-skip-entry t))
              (save-excursion
                (while (and (not should-skip-entry) (org-goto-sibling t))
                  (when (org-current-is-todo)
                    (setq should-skip-entry t))))
              (when should-skip-entry
                (or (outline-next-heading)
                    (goto-char (point-max))))))
        
          (defun org-current-is-todo ()
            (string= "TODO" (org-get-todo-state))))

2.  Todo Keywords

    Set up todo keyword workflow  
    
        (after! org
          (setq org-todo-keywords '((sequence "TODO(t)" "WAITING(w@)" "|" "DONE(d)" "CANCELLED(c@)"))))

3.  Capture Templates

        (after! org
          (setq org-capture-templates '(("t" "Todo [inbox]" entry (file+headline "~/Dropbox/org/gtd/inbox.org" "Tasks") "* TODO %i%?\n")
                                        ("T" "Tickler" entry (file+headline "~/Dropbox/org/gtd/tickler.org" "Tickler") "* %i%? \n %U")
                                        ("j" "Journal" entry (file+datetree "~/Dropbox/org/gtd/diary.org") "* %?\n%U\n")
                                        ("h" "habit" entry (file "~/Dropbox/org/gtd/inbox.org")
                                         "* TODO %?\nSCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a .+1d/3d>>\")\n:PROPERTIES:\n:STYLE: habit \n:END:\n%U\n")
                                        ("n" "Note" entry (file+headline "~/Dropbox/org/gtd/inbox.org" "Notes") "* %? :NOTE:\n%U\n"))))

4.  Remove scheduled headlines and deadlines from the agenda once they&rsquo;re marked done

        (after! org
          (setq org-agenda-skip-scheduled-if-done t)
          (setq org-agenda-skip-deadline-if-done t))
