config.org
**** Ignore scheduled headlines and deadlines in the global todo list
#+BEGIN_SRC emacs-lisp
(after! org
  (setq org-agenda-todo-ignore-scheduled t)
  (setq org-agenda-todo-ignore-deadlines t))
#+END_SRC
**** Set org download method
not sure what happened here lol, leaving for now.
#+BEGIN_SRC emacs-lisp

#+END_SRC
**** Super Agenda
#+BEGIN_SRC emacs-lisp
(after! org-agenda
  (org-super-agenda-mode)

  (setq org-agenda-custom-commands
        '(("o" "Overview"
           ((agenda "" ((org-agenda-span 'day)
                        (org-super-agenda-groups
                         '((:name "Today"
                                  :time-grid t
                                  :date today
                                  :todo "TODAY"
                                  :scheduled today
                                  :order 1)))))
            (alltodo "" ((org-agenda-overriding-header "")
                         (org-super-agenda-groups
                          '((:name "Todo"
                                   :todo "TODO"
                                   :order 1)
                            (:name "Important"
                                   :tag "Important"
                                   :priority "A"
                                   :order 6)
                            (:name "Emacs"
                                   :tag "Emacs"
                                   :order 13)
                            (:name "Projects"
                                   :tag "Project"
                                   :order 14)
                            (:name "To read"
                                   :tag "Read"
                                   :order 30)
                            (:name "Waiting"
                                   :todo "WAITING"
                                   :order 20)
                            (:name "Trivial"
                                   :priority<= "E"
                                   :tag ("Trivial" "Unimportant")
                                   :todo ("SOMEDAY" )
                                   :order 90)
                            (:discard (:tag ("Chore" "Routine" "Daily"))))))))))))
#+END_SRC
** SQL mode config
*** Cars.com db connections
