config.html
<li><a id="org6bd88d1"></a>Ignore scheduled headlines and deadlines in the global todo list<br />
<div class="outline-text-5" id="text-3-1-3-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">after!</span> <span style="color: #a7aac0;">org</span>
  <span style="color: #2196F3;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-agenda-todo-ignore-scheduled</span> <span style="color: #99bbb4;">t</span><span style="color: #2196F3;">)</span>
  <span style="color: #2196F3;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-agenda-todo-ignore-deadlines</span> <span style="color: #99bbb4;">t</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgeef8d32"></a>Set org download method<br />
<div class="outline-text-5" id="text-3-1-3-6">
<p>
not sure what happened here lol, leaving for now.<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">
</pre>
</div>
</div>
</li>
<li><a id="org38eee42"></a>Super Agenda<br />
<div class="outline-text-5" id="text-3-1-3-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e91e63;">(</span><span style="color: #fff59d;">after!</span> <span style="color: #c0a7bd;">org-agenda</span>
  <span style="color: #2196F3;">(</span><span style="color: #ffcc80;">org-super-agenda-mode</span><span style="color: #2196F3;">)</span>

  <span style="color: #2196F3;">(</span><span style="color: #fff59d;">setq</span> <span style="color: #ffcc80;">org-agenda-custom-commands</span>
        <span style="color: #fff59d;">'</span><span style="color: #EF6C00;">(</span><span style="color: #B388FF;">(</span><span style="color: #9ccc65;">"o"</span> <span style="color: #9ccc65;">"Overview"</span>
           <span style="color: #e91e63;">(</span><span style="color: #2196F3;">(</span><span style="color: #99bbb4;">agenda</span> <span style="color: #9ccc65;">""</span> <span style="color: #EF6C00;">(</span><span style="color: #B388FF;">(</span><span style="color: #ffcc80;">org-agenda-span</span> <span style="color: #fff59d;">'</span><span style="color: #a3e0a0;">day</span><span style="color: #B388FF;">)</span>
                        <span style="color: #B388FF;">(</span><span style="color: #ffcc80;">org-super-agenda-groups</span>
                         <span style="color: #fff59d;">'</span><span style="color: #e91e63;">(</span><span style="color: #2196F3;">(</span><span style="color: #ff8A65;">:name</span> <span style="color: #9ccc65;">"Today"</span>
                                  <span style="color: #ff8A65;">:time-grid</span> <span style="color: #99bbb4;">t</span>
                                  <span style="color: #ff8A65;">:date</span> <span style="color: #b3c0a7;">today</span>
                                  <span style="color: #ff8A65;">:todo</span> <span style="color: #9ccc65;">"TODAY"</span>
                                  <span style="color: #ff8A65;">:scheduled</span> <span style="color: #b3c0a7;">today</span>
                                  <span style="color: #ff8A65;">:order</span> <span style="color: #9ccc65;">1</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span><span style="color: #B388FF;">)</span><span style="color: #EF6C00;">)</span><span style="color: #2196F3;">)</span>
            <span style="color: #2196F3;">(</span><span style="color: #99bbb4;">alltodo</span> <span style="color: #9ccc65;">""</span> <span style="color: #EF6C00;">(</span><span style="color: #B388FF;">(</span><span style="color: #ffcc80;">org-agenda-overriding-header</span> <span style="color: #9ccc65;">""</span><span style="color: #B388FF;">)</span>
                         <span style="color: #B388FF;">(</span><span style="color: #ffcc80;">org-super-agenda-groups</span>
                          <span style="color: #fff59d;">'</span><span style="color: #e91e63;">(</span><span style="color: #2196F3;">(</span><span style="color: #ff8A65;">:name</span> <span style="color: #9ccc65;">"Todo"</span>
                                   <span style="color: #ff8A65;">:todo</span> <span style="color: #9ccc65;">"</span><span style="color: #ff9800; font-weight: bold;">TODO</span><span style="color: #9ccc65;">"</span>
                                   <span style="color: #ff8A65;">:order</span> <span style="color: #9ccc65;">1</span><span style="color: #2196F3;">)</span>
                            <span style="color: #2196F3;">(</span><span style="color: #ff8A65;">:name</span> <span style="color: #9ccc65;">"Important"</span>
                                   <span style="color: #ff8A65;">:tag</span> <span style="color: #9ccc65;">"Important"</span>
                                   <span style="color: #ff8A65;">:priority</span> <span style="color: #9ccc65;">"A"</span>
                                   <span style="color: #ff8A65;">:order</span> <span style="color: #9ccc65;">6</span><span style="color: #2196F3;">)</span>
                            <span style="color: #2196F3;">(</span><span style="color: #ff8A65;">:name</span> <span style="color: #9ccc65;">"Emacs"</span>
                                   <span style="color: #ff8A65;">:tag</span> <span style="color: #9ccc65;">"Emacs"</span>
                                   <span style="color: #ff8A65;">:order</span> <span style="color: #9ccc65;">13</span><span style="color: #2196F3;">)</span>
                            <span style="color: #2196F3;">(</span><span style="color: #ff8A65;">:name</span> <span style="color: #9ccc65;">"Projects"</span>
                                   <span style="color: #ff8A65;">:tag</span> <span style="color: #9ccc65;">"Project"</span>
                                   <span style="color: #ff8A65;">:order</span> <span style="color: #9ccc65;">14</span><span style="color: #2196F3;">)</span>
                            <span style="color: #2196F3;">(</span><span style="color: #ff8A65;">:name</span> <span style="color: #9ccc65;">"To read"</span>
                                   <span style="color: #ff8A65;">:tag</span> <span style="color: #9ccc65;">"Read"</span>
                                   <span style="color: #ff8A65;">:order</span> <span style="color: #9ccc65;">30</span><span style="color: #2196F3;">)</span>
                            <span style="color: #2196F3;">(</span><span style="color: #ff8A65;">:name</span> <span style="color: #9ccc65;">"Waiting"</span>
                                   <span style="color: #ff8A65;">:todo</span> <span style="color: #9ccc65;">"WAITING"</span>
                                   <span style="color: #ff8A65;">:order</span> <span style="color: #9ccc65;">20</span><span style="color: #2196F3;">)</span>
                            <span style="color: #2196F3;">(</span><span style="color: #ff8A65;">:name</span> <span style="color: #9ccc65;">"Trivial"</span>
                                   <span style="color: #ff8A65;">:priority&lt;=</span> <span style="color: #9ccc65;">"E"</span>
                                   <span style="color: #ff8A65;">:tag</span> <span style="color: #EF6C00;">(</span><span style="color: #9ccc65;">"Trivial"</span> <span style="color: #9ccc65;">"Unimportant"</span><span style="color: #EF6C00;">)</span>
                                   <span style="color: #ff8A65;">:todo</span> <span style="color: #EF6C00;">(</span><span style="color: #9ccc65;">"SOMEDAY"</span> <span style="color: #EF6C00;">)</span>
                                   <span style="color: #ff8A65;">:order</span> <span style="color: #9ccc65;">90</span><span style="color: #2196F3;">)</span>
                            <span style="color: #2196F3;">(</span><span style="color: #ff8A65;">:discard</span> <span style="color: #EF6C00;">(</span><span style="color: #ff8A65;">:tag</span> <span style="color: #B388FF;">(</span><span style="color: #9ccc65;">"Chore"</span> <span style="color: #9ccc65;">"Routine"</span> <span style="color: #9ccc65;">"Daily"</span><span style="color: #B388FF;">)</span><span style="color: #EF6C00;">)</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span><span style="color: #B388FF;">)</span><span style="color: #EF6C00;">)</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span><span style="color: #B388FF;">)</span><span style="color: #EF6C00;">)</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
